# Brewfile — declarative Mac package management
# Install: brew bundle
# Update:  brew bundle --cleanup (removes unlisted packages)

# Core CLI tools
brew "git"
brew "gh"
brew "tmux"
brew "vim"
brew "wget"
brew "curl"
brew "tree"
brew "htop"
brew "jq"
brew "zstd"            # fast compression (zstd / unzstd)

# Better CLI defaults
brew "ripgrep"         # faster grep (rg)
brew "fd"              # faster find
brew "fzf"             # fuzzy finder
brew "bat"             # better cat with syntax highlighting
brew "eza"             # better ls

# Python / ML
cask "miniforge"       # conda without Anaconda bloat

# Terminal
cask "ghostty"
